# DataFrames

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [3]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [22]:
pd.DataFrame(randn(5,4),columns='W X Y Z'.split())

          W         X         Y         Z
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752
4 -0.116773  1.901755  0.238127  1.996652

In [4]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [5]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [8]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame
- df['W']
- df[['W','Z']]
- df.W -- SQL syntax - not recommended

In [9]:
df.columns, df.index

(Index(['W', 'X', 'Y', 'Z'], dtype='object'),
 Index(['A', 'B', 'C', 'D', 'E'], dtype='object'))

In [11]:
df['W']['C']

-2.018168244037392

In [12]:
df.loc['D']

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

DataFrame Columns are just Series
- check the type of df['W']

**Creating a new column:**
- new column by addition of two columns df['W'] + df['Y']
- new column by assigning a scalar value df['age']=40

In [18]:
df['age']=40

In [19]:
df

          W         X         Y         Z  age
A  2.706850  0.628133  0.907969  0.503826   40
B  0.651118 -0.319318 -0.848077  0.605965   40
C -2.018168  0.740122  0.528813 -0.589001   40
D  0.188695 -0.758872 -0.933237  0.955057   40
E  0.190794  1.978757  2.605967  0.683509   40

In [20]:
df['totalprice'] =df['W'] * df['X']

In [23]:
df['dev'] = df['Z']-df['Z'].mean()
df

          W         X         Y         Z  age  totalprice       dev
A  2.706850  0.628133  0.907969  0.503826   40    1.700261  0.071955
B  0.651118 -0.319318 -0.848077  0.605965   40   -0.207914  0.174094
C -2.018168  0.740122  0.528813 -0.589001   40   -1.493691 -1.020872
D  0.188695 -0.758872 -0.933237  0.955057   40   -0.143196  0.523185
E  0.190794  1.978757  2.605967  0.683509   40    0.377536  0.251638

In [82]:
df['default_age'] = 18

In [85]:
df['W'] * df['X']

A    0.512631
B   -0.052659
C    0.058930
D    0.374851
E   -0.222074
dtype: float64

** Removing Columns**
- df.drop(<name of the column>, axis = 1)
- df.drop(<name of the row>, axis = 0)
- use inplace for permanent drop

In [28]:
df.drop('A', inplace=True)

In [32]:
df.drop('W',axis=1, inplace=True)

In [37]:
df.drop('B', inplace=True)

In [38]:
df

          X         Y         Z  age  totalprice       dev
C  0.740122  0.528813 -0.589001   40   -1.493691 -1.020872
D -0.758872 -0.933237  0.955057   40   -0.143196  0.523185
E  1.978757  2.605967  0.683509   40    0.377536  0.251638

In [93]:
df.drop('A', inplace=True)

In [98]:
df.drop('W', axis = 1)

          X         Y         Z  totalprice  default_age
B  0.390528  0.166905  0.184502   -0.052659           18
C  0.072960  0.638787  0.329646    0.058930           18
D -0.754070 -0.943406  0.484752    0.374851           18
E  1.901755  0.238127  1.996652   -0.222074           18

** Selecting Columns**

In [43]:
df[['X']]

          X
C  0.740122
D -0.758872
E  1.978757

In [97]:
df[['W','X']]

          W         X
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [44]:
df

          X         Y         Z  age  totalprice       dev
C  0.740122  0.528813 -0.589001   40   -1.493691 -1.020872
D -0.758872 -0.933237  0.955057   40   -0.143196  0.523185
E  1.978757  2.605967  0.683509   40    0.377536  0.251638

In [46]:
df[df['dev'] > 0]

          X         Y         Z  age  totalprice       dev
D -0.758872 -0.933237  0.955057   40   -0.143196  0.523185
E  1.978757  2.605967  0.683509   40    0.377536  0.251638

In [110]:
(df['W'] + df ['Y'])> 0

B     True
C     True
D    False
E     True
dtype: bool

In [111]:
df[(df['W'] + df ['Y'])> 0]

          W         X         Y         Z  totalprice  default_age
B -0.134841  0.390528  0.166905  0.184502   -0.052659           18
C  0.807706  0.072960  0.638787  0.329646    0.058930           18
E -0.116773  1.901755  0.238127  1.996652   -0.222074           18

In [114]:
df[(df['W'] >0) & (df ['Y']> 0)][['W','X']]

          W        X
C  0.807706  0.07296

In [115]:
print(df['W'] >0)
print(df['Y']>0)

B    False
C     True
D    False
E    False
Name: W, dtype: bool
B     True
C     True
D    False
E     True
Name: Y, dtype: bool

In [47]:
df.T

                    C          D          E
X            0.740122  -0.758872   1.978757
Y            0.528813  -0.933237   2.605967
Z           -0.589001   0.955057   0.683509
age         40.000000  40.000000  40.000000
totalprice  -1.493691  -0.143196   0.377536
dev         -1.020872   0.523185   0.251638

In [124]:
df.T[df.T['B'] > 0]

                     B          C          D          E
X             0.390528   0.072960  -0.754070   1.901755
Y             0.166905   0.638787  -0.943406   0.238127
Z             0.184502   0.329646   0.484752   1.996652
default_age  18.000000  18.000000  18.000000  18.000000